In [1]:
people = {
    "first": ["Corey", "Jane", "Jhon"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchager@gmail.com", "loco@gamil.com", "lineal@gmail.com"],
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchager@gmail.com
1   Jane      Doe           loco@gamil.com
2   Jhon      Doe         lineal@gmail.com

### This is how we add columns to our DataFrame

In [4]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         Jhon Doe
dtype: object

In [5]:
df['Full_Name'] = df['first'] + ' ' + df['last'] # <--- created a new column

In [6]:
df

   first     last                    email      Full_Name
0  Corey  Schafer  CoreyMSchager@gmail.com  Corey Schafer
1   Jane      Doe           loco@gamil.com       Jane Doe
2   Jhon      Doe         lineal@gmail.com       Jhon Doe

### This is how we remove columns to our DataFrame

In [7]:
df.drop(columns=['first', 'last'], inplace=True) # <-- Borra las columnas first y last
df
# Hey, Imanol other thing!
# You can simply delete columns by using "del" function.
# For example: del df['full_name']

                     email      Full_Name
0  CoreyMSchager@gmail.com  Corey Schafer
1           loco@gamil.com       Jane Doe
2         lineal@gmail.com       Jhon Doe

In [8]:
df['Full_Name'].str.split(" ", expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   Jhon      Doe

In [9]:
df[['first', 'last']] = df['Full_Name'].str.split(" ", expand=True)

In [10]:
df

                     email      Full_Name  first     last
0  CoreyMSchager@gmail.com  Corey Schafer  Corey  Schafer
1           loco@gamil.com       Jane Doe   Jane      Doe
2         lineal@gmail.com       Jhon Doe   Jhon      Doe

In [11]:
# df.drop(columns=['Full_Name'])

In [12]:
# df.append({'first': 'Tony'})  Append was deprecated in new versions of pandas, now are used concat 
df = pd.concat([df,pd.DataFrame([{'first': 'Tony'}])])# <-- Add single row / ignore index

In [13]:
df

                     email      Full_Name  first     last
0  CoreyMSchager@gmail.com  Corey Schafer  Corey  Schafer
1           loco@gamil.com       Jane Doe   Jane      Doe
2         lineal@gmail.com       Jhon Doe   Jhon      Doe
0                      NaN            NaN   Tony      NaN

In [14]:
people2 = {
    "first": ["George", "Martin"],
    "last": ["Hotz", "Shkreli"],
    "email": ["Hotz@gmail.com", "Shkreli@gamil.com"],
}
df2 = pd.DataFrame(people2)
df2

    first     last              email
0  George     Hotz     Hotz@gmail.com
1  Martin  Shkreli  Shkreli@gamil.com

In [15]:
df = pd.concat([df, df2], ignore_index=True, sort=False) # <--- this replaces the method append of min 11:30

In [16]:
df

                     email      Full_Name   first     last
0  CoreyMSchager@gmail.com  Corey Schafer   Corey  Schafer
1           loco@gamil.com       Jane Doe    Jane      Doe
2         lineal@gmail.com       Jhon Doe    Jhon      Doe
3                      NaN            NaN    Tony      NaN
4           Hotz@gmail.com            NaN  George     Hotz
5        Shkreli@gamil.com            NaN  Martin  Shkreli

In [17]:
df.drop(index=(3), inplace=True)    # <--- remover un row individual
df

                     email      Full_Name   first     last
0  CoreyMSchager@gmail.com  Corey Schafer   Corey  Schafer
1           loco@gamil.com       Jane Doe    Jane      Doe
2         lineal@gmail.com       Jhon Doe    Jhon      Doe
4           Hotz@gmail.com            NaN  George     Hotz
5        Shkreli@gamil.com            NaN  Martin  Shkreli

In [18]:
df.drop(index=[4,5], inplace=True)   # <--- remover un grupo de rows
df

                     email      Full_Name  first     last
0  CoreyMSchager@gmail.com  Corey Schafer  Corey  Schafer
1           loco@gamil.com       Jane Doe   Jane      Doe
2         lineal@gmail.com       Jhon Doe   Jhon      Doe

In [19]:
df

                     email      Full_Name  first     last
0  CoreyMSchager@gmail.com  Corey Schafer  Corey  Schafer
1           loco@gamil.com       Jane Doe   Jane      Doe
2         lineal@gmail.com       Jhon Doe   Jhon      Doe

In [20]:
df.drop(index=df[df['last'] == 'Doe'].index)  # <-- Remover rows con un condicional
#Tambien recuerda que puedes almacenar el condicional en una variable y solo pasar la variable al drop index=[filt]#
filt = df['last'] == 'Doe' # <-- Usando

In [21]:
df

                     email      Full_Name  first     last
0  CoreyMSchager@gmail.com  Corey Schafer  Corey  Schafer
1           loco@gamil.com       Jane Doe   Jane      Doe
2         lineal@gmail.com       Jhon Doe   Jhon      Doe